set_property IOSTANDARD LVCMOS18 [get_ports {stage[2]}]
set_property IOSTANDARD LVCMOS18 [get_ports {stage[1]}]
set_property IOSTANDARD LVCMOS18 [get_ports {stage[0]}]
set_property PACKAGE_PIN U14 [get_ports {stage[2]}]
set_property PACKAGE_PIN U19 [get_ports {stage[1]}]
set_property PACKAGE_PIN W22 [get_ports {stage[0]}]
set_property IOSTANDARD LVCMOS18 [get_ports c_in]
set_property IOSTANDARD LVCMOS18 [get_ports done]
set_property IOSTANDARD LVCMOS18 [get_ports input_valve]
set_property IOSTANDARD LVCMOS18 [get_ports lid]
set_property IOSTANDARD LVCMOS18 [get_ports output_drain]
set_property IOSTANDARD LVCMOS18 [get_ports pause]
set_property IOSTANDARD LVCMOS18 [get_ports reset]
set_property IOSTANDARD LVCMOS18 [get_ports start]
set_property PACKAGE_PIN Y9 [get_ports c_in]
set_property PACKAGE_PIN T22 [get_ports done]
set_property PACKAGE_PIN U22 [get_ports input_valve]
set_property PACKAGE_PIN M15 [get_ports lid]
set_property PACKAGE_PIN T21 [get_ports output_drain]
set_property PACKAGE_PIN G22 [get_ports pause]
set_property PACKAGE_PIN H22 [get_ports reset]
set_property PACKAGE_PIN F22 [get_ports start]

create_clock -period 10.000 -name c_in -waveform {0.000 5.000} [get_ports c_in]
create_generated_clock -name clk_div/clk -source [get_ports c_in] -divide_by 100000000 [get_pins clk_div/c_out_reg/Q]

create_clock -period 1000000000.000 -name VIRTUAL_clk_div/clk -waveform {0.000 500000000.000}
set_input_delay -clock [get_clocks VIRTUAL_clk_div/clk] -min -add_delay 2.000 [get_ports lid]
set_input_delay -clock [get_clocks VIRTUAL_clk_div/clk] -max -add_delay 2.000 [get_ports lid]
set_input_delay -clock [get_clocks VIRTUAL_clk_div/clk] -min -add_delay 2.000 [get_ports pause]
set_input_delay -clock [get_clocks VIRTUAL_clk_div/clk] -max -add_delay 2.000 [get_ports pause]
set_input_delay -clock [get_clocks c_in] -min -add_delay 2.000 [get_ports reset]
set_input_delay -clock [get_clocks c_in] -max -add_delay 2.000 [get_ports reset]
set_input_delay -clock [get_clocks VIRTUAL_clk_div/clk] -min -add_delay 2.000 [get_ports reset]
set_input_delay -clock [get_clocks VIRTUAL_clk_div/clk] -max -add_delay 2.000 [get_ports reset]
set_input_delay -clock [get_clocks VIRTUAL_clk_div/clk] -min -add_delay 2.000 [get_ports start]
set_input_delay -clock [get_clocks VIRTUAL_clk_div/clk] -max -add_delay 2.000 [get_ports start]
set_output_delay -clock [get_clocks VIRTUAL_clk_div/clk] -min -add_delay 0.000 [get_ports {stage[*]}]
set_output_delay -clock [get_clocks VIRTUAL_clk_div/clk] -max -add_delay 2.000 [get_ports {stage[*]}]
set_output_delay -clock [get_clocks VIRTUAL_clk_div/clk] -min -add_delay 0.000 [get_ports done]
set_output_delay -clock [get_clocks VIRTUAL_clk_div/clk] -max -add_delay 2.000 [get_ports done]
set_output_delay -clock [get_clocks VIRTUAL_clk_div/clk] -min -add_delay 0.000 [get_ports input_valve]
set_output_delay -clock [get_clocks VIRTUAL_clk_div/clk] -max -add_delay 2.000 [get_ports input_valve]
set_output_delay -clock [get_clocks VIRTUAL_clk_div/clk] -min -add_delay 0.000 [get_ports output_drain]
set_output_delay -clock [get_clocks VIRTUAL_clk_div/clk] -max -add_delay 2.000 [get_ports output_drain]
